Autodesk.Revit.DB.Structure.AreaReinforcementCurve.Curve
Returns the 3D curve forming part of the boundary of an Area Reinforcement element.

Autodesk.Revit.DB.Structure.AreaReinforcementCurve
An object that specifies the type of a floor in Autodesk Revit.
Remarks: The structural layers of the floor can be accessed via this object.